Revit 2027 API
ExternalResourceReference(ExternalResourceReference) Constructor
 Creates a new ExternalResourceReference from the given ExternalResourceReference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalResourceReference(
	ExternalResourceReference other
)
Public Sub New (
	other As ExternalResourceReference
)
public:
ExternalResourceReference(
	ExternalResourceReference^ other
)
new :
        other : ExternalResourceReference -> ExternalResourceReference
Parameters
other ExternalResourceReference
 The ExternalResourceReference to copy.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternalResourceReference Class
ExternalResourceReference Overload
Autodesk.Revit.DB Namespace